vortexntnu/vortex-auv-embedded/bms/bms/bms_config_e18a/src/packs/ATSAMC21E18A_DFP/component/rtc.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* RTC register API structure */
typedef struct
{  /* Real-Time Counter */
  __IO  uint16_t                       RTC_CTRLA;          /* Offset: 0x00 (R/W  16) MODE0 Control A */
  __I   uint8_t                        Reserved1[0x02];
  __IO  uint32_t                       RTC_EVCTRL;         /* Offset: 0x04 (R/W  32) MODE0 Event Control */
  __IO  uint16_t                       RTC_INTENCLR;       /* Offset: 0x08 (R/W  16) MODE0 Interrupt Enable Clear */
  __IO  uint16_t                       RTC_INTENSET;       /* Offset: 0x0A (R/W  16) MODE0 Interrupt Enable Set */
  __IO  uint16_t                       RTC_INTFLAG;        /* Offset: 0x0C (R/W  16) MODE0 Interrupt Flag Status and Clear */
  __IO  uint8_t                        RTC_DBGCTRL;        /* Offset: 0x0E (R/W  8) Debug Control */
  __I   uint8_t                        Reserved2[0x01];
  __I   uint32_t                       RTC_SYNCBUSY;       /* Offset: 0x10 (R/   32) MODE0 Synchronization Busy Status */
  __IO  uint8_t                        RTC_FREQCORR;       /* Offset: 0x14 (R/W  8) Frequency Correction */
  __I   uint8_t                        Reserved3[0x03];
  __IO  uint32_t                       RTC_COUNT;          /* Offset: 0x18 (R/W  32) MODE0 Counter Value */
  __I   uint8_t                        Reserved4[0x04];
  __IO  uint32_t                       RTC_COMP;           /* Offset: 0x20 (R/W  32) MODE0 Compare n Value */
} rtc_mode0_registers_t;

/* RTC register API structure */
typedef struct
{  /* Real-Time Counter */
  __IO  uint16_t                       RTC_CTRLA;          /* Offset: 0x00 (R/W  16) MODE1 Control A */
  __I   uint8_t                        Reserved1[0x02];
  __IO  uint32_t                       RTC_EVCTRL;         /* Offset: 0x04 (R/W  32) MODE1 Event Control */
  __IO  uint16_t                       RTC_INTENCLR;       /* Offset: 0x08 (R/W  16) MODE1 Interrupt Enable Clear */
  __IO  uint16_t                       RTC_INTENSET;       /* Offset: 0x0A (R/W  16) MODE1 Interrupt Enable Set */
  __IO  uint16_t                       RTC_INTFLAG;        /* Offset: 0x0C (R/W  16) MODE1 Interrupt Flag Status and Clear */
  __IO  uint8_t                        RTC_DBGCTRL;        /* Offset: 0x0E (R/W  8) Debug Control */
  __I   uint8_t                        Reserved2[0x01];
  __I   uint32_t                       RTC_SYNCBUSY;       /* Offset: 0x10 (R/   32) MODE1 Synchronization Busy Status */
  __IO  uint8_t                        RTC_FREQCORR;       /* Offset: 0x14 (R/W  8) Frequency Correction */
  __I   uint8_t                        Reserved3[0x03];
  __IO  uint16_t                       RTC_COUNT;          /* Offset: 0x18 (R/W  16) MODE1 Counter Value */
  __I   uint8_t                        Reserved4[0x02];
  __IO  uint16_t                       RTC_PER;            /* Offset: 0x1C (R/W  16) MODE1 Counter Period */
  __I   uint8_t                        Reserved5[0x02];
  __IO  uint16_t                       RTC_COMP[2];        /* Offset: 0x20 (R/W  16) MODE1 Compare n Value */
} rtc_mode1_registers_t;

/* RTC register API structure */
typedef struct
{  /* Real-Time Counter */
  __IO  uint16_t                       RTC_CTRLA;          /* Offset: 0x00 (R/W  16) MODE2 Control A */
  __I   uint8_t                        Reserved1[0x02];
  __IO  uint32_t                       RTC_EVCTRL;         /* Offset: 0x04 (R/W  32) MODE2 Event Control */
  __IO  uint16_t                       RTC_INTENCLR;       /* Offset: 0x08 (R/W  16) MODE2 Interrupt Enable Clear */
  __IO  uint16_t                       RTC_INTENSET;       /* Offset: 0x0A (R/W  16) MODE2 Interrupt Enable Set */
  __IO  uint16_t                       RTC_INTFLAG;        /* Offset: 0x0C (R/W  16) MODE2 Interrupt Flag Status and Clear */
  __IO  uint8_t                        RTC_DBGCTRL;        /* Offset: 0x0E (R/W  8) Debug Control */
  __I   uint8_t                        Reserved2[0x01];
  __I   uint32_t                       RTC_SYNCBUSY;       /* Offset: 0x10 (R/   32) MODE2 Synchronization Busy Status */
  __IO  uint8_t                        RTC_FREQCORR;       /* Offset: 0x14 (R/W  8) Frequency Correction */
  __I   uint8_t                        Reserved3[0x03];
  __IO  uint32_t                       RTC_CLOCK;          /* Offset: 0x18 (R/W  32) MODE2 Clock Value */
  __I   uint8_t                        Reserved4[0x04];
  __IO  uint32_t                       RTC_ALARM;          /* Offset: 0x20 (R/W  32) MODE2_ALARM Alarm n Value */
  __IO  uint8_t                        RTC_MASK;           /* Offset: 0x24 (R/W  8) MODE2_ALARM Alarm n Mask */
} rtc_mode2_registers_t;

/* RTC hardware registers */
typedef union
{  /* Real-Time Counter */
       rtc_mode0_registers_t          MODE0;          /* 32-bit Counter with Single 32-bit Compare */
       rtc_mode1_registers_t          MODE1;          /* 16-bit Counter with Two 16-bit Compares */
       rtc_mode2_registers_t          MODE2;          /* Clock/Calendar with Alarm */
} rtc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMC21_RTC_COMPONENT_H_ */
